FKDD_COPY_DIFF_3_2026-02-14/InformationRegisters/ГраницыЗаказыНаАвтомобили.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<InformationRegister>
		<Properties>
			<Name>ГраницыЗаказыНаАвтомобили</Name>
			<Comment>Границы последовательности заказов на автомобили</Comment>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>МоментВремени</Name>
					<Comment>Момент времени</Comment>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ДокументСсылка</Name>
					<Comment>Документ ссылка</Comment>
					<Type>
						<v8:TypeSet>cfg:DocumentRef</v8:TypeSet>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>Автомобиль</Name>
					<Comment>Автомобиль</Comment>
					<Type>
						<v8:Type>cfg:CatalogRef.Автомобили</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Организация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

FKDD_COPY_DIFF_3_2026-02-14/InformationRegisters/ГраницыЗаказыНаАвтомобили/Ext/RecordSetModule.bsl
Перем Автомобиль Экспорт;   // Справочник.Автомобили ИЛИ Массив. Содержит автомобили по которым сдвигается граница последовательности
Перем АвтомобильБыл Экспорт;   // Справочник.Автомобили ИЛИ Массив. Содержит автомобили по которым сдвигается граница последовательности
Перем МоментВремени Экспорт;   // Дата-время документа
Перем МоментВремениБыл Экспорт;   // Дата-время документа до изменения
Перем ДокументСсылка Экспорт;  // Ссылка на документ

// проверяет, надо ли двигать границу последовательности и если надо - сдвигает
Функция ИзменитьГраницу(БезПроверок=Ложь) Экспорт
	
	// если Автомобиль один, то преобразуем его в массив
	МассивАвтомобилейНовые = Новый Массив();
	МассивАвтомобилейСтарые = Новый Массив();
	// фильтр на автомобили
	МассивАвтомобилейФильтр = Новый Массив();
	Если ТипЗнч(Автомобиль)<>Тип("Массив") Тогда
		МассивАвтомобилейНовые.Добавить(Автомобиль);
		МассивАвтомобилейФильтр.Добавить(Автомобиль);
	Иначе
		Для Каждого ТекАвтомобиль Из Автомобиль Цикл
			МассивАвтомобилейНовые.Добавить(ТекАвтомобиль);
			МассивАвтомобилейФильтр.Добавить(ТекАвтомобиль);
		КонецЦикла;
	КонецЕсли;
	Если ЗначениеЗаполнено(АвтомобильБыл) И ТипЗнч(АвтомобильБыл)<>Тип("Массив") И МассивАвтомобилейНовые.Найти(АвтомобильБыл)=Неопределено Тогда
		МассивАвтомобилейСтарые.Добавить(АвтомобильБыл);
		МассивАвтомобилейФильтр.Добавить(АвтомобильБыл);
	ИначеЕсли ЗначениеЗаполнено(АвтомобильБыл) Тогда
		Для Каждого ТекАвтомобиль Из АвтомобильБыл Цикл
			Если МассивАвтомобилейНовые.Найти(ТекАвтомобиль)=Неопределено Тогда
				МассивАвтомобилейСтарые.Добавить(ТекАвтомобиль);
				МассивАвтомобилейФильтр.Добавить(ТекАвтомобиль);
			КонецЕсли;
		КонецЦикла;
	КонецЕсли;
	
	// получаем текущие границы
	Запрос = Новый Запрос("
	|ВЫБРАТЬ
	|	Автомобиль КАК Автомобиль,
	|	МоментВремени КАК МоментВремени,
	|	ДокументСсылка КАК ДокументСсылка
	|ИЗ
	|	РегистрСведений.ГраницыЗаказыНаАвтомобили
	|ГДЕ
	|	Автомобиль В(&Автомобили)

	|");
	Запрос.УстановитьПараметр("Автомобили",МассивАвтомобилейФильтр);
	ТаблицаРезультата = Запрос.Выполнить().Выгрузить();
	
	МоментВремениДокумента = ?(ТипЗнч(МоментВремени)=Тип("МоментВремени") И ДокументСсылка<>Неопределено, Новый МоментВремени(Мин(ДокументСсылка.Дата, МоментВремени.Дата), ДокументСсылка), Новый МоментВремени(МоментВремени, ДокументСсылка));
	Если ЗначениеЗаполнено(МоментВремениБыл) Тогда
		МоментВремениДокумента = ?(МоментВремениДокумента.Сравнить(МоментВремениБыл)=1,МоментВремениБыл,МоментВремениДокумента);
	КонецЕсли;
	// идем по новым автомобилям и смотрим надо ли сдвинуть границу
	Для Каждого СледующийАвтомобиль Из МассивАвтомобилейНовые Цикл
		ДвигаемГраницу = Ложь;
		СтрокаРезультата = ТаблицаРезультата.Найти(СледующийАвтомобиль,"Автомобиль");
	
		Если СтрокаРезультата=Неопределено Тогда
			ДвигаемГраницу = Истина;
		Иначе
			Если НЕ обЗначениеНеЗаполнено(СтрокаРезультата.ДокументСсылка) Тогда
				МоментВремениГраницы = Новый МоментВремени(СтрокаРезультата.МоментВремени,СтрокаРезультата.ДокументСсылка);
			Иначе
				МоментВремениГраницы = Новый МоментВремени(СтрокаРезультата.МоментВремени);
			КонецЕсли;
			ДвигаемГраницу = (МоментВремениГраницы.Сравнить(МоментВремениДокумента) = 1);
		КонецЕсли;
		
		// если границу надо двигать, двигаем
		Если ЗначениеЗаполнено(СледующийАвтомобиль) И (ДвигаемГраницу ИЛИ БезПроверок) Тогда
			НоваяЗапись = РегистрыСведений.ГраницыЗаказыНаАвтомобили.СоздатьМенеджерЗаписи();
			НоваяЗапись.Автомобиль = СледующийАвтомобиль;
			НоваяЗапись.МоментВремени = МоментВремениДокумента.Дата;
			НоваяЗапись.ДокументСсылка = МоментВремениДокумента.Ссылка;
			НоваяЗапись.Записать(Истина);
		КонецЕсли;
	КонецЦикла;
	
	// теперь тот-же проход, но по старым автомобилям
	Для Каждого СледующийАвтомобиль Из МассивАвтомобилейСтарые Цикл
		ДвигаемГраницу = Ложь;
		СтрокаРезультата = ТаблицаРезультата.Найти(СледующийАвтомобиль,"Автомобиль");
		
		Если СтрокаРезультата=Неопределено Тогда
			ДвигаемГраницу = Истина;
		Иначе
			Если НЕ обЗначениеНеЗаполнено(СтрокаРезультата.ДокументСсылка) Тогда
				МоментВремениГраницы = Новый МоментВремени(СтрокаРезультата.МоментВремени,СтрокаРезультата.ДокументСсылка);
			Иначе
				МоментВремениГраницы = Новый МоментВремени(СтрокаРезультата.МоментВремени);
			КонецЕсли;
			ДвигаемГраницу = (МоментВремениГраницы.Сравнить(МоментВремениБыл) = 1);
		КонецЕсли;
		
		// если границу надо двигать, двигаем
		Если ЗначениеЗаполнено(СледующийАвтомобиль) И (ДвигаемГраницу ИЛИ БезПроверок) Тогда
			НоваяЗапись = РегистрыСведений.ГраницыЗаказыНаАвтомобили.СоздатьМенеджерЗаписи();
			НоваяЗапись.Автомобиль = СледующийАвтомобиль;
			НоваяЗапись.МоментВремени = МоментВремениБыл.Дата;
			НоваяЗапись.ДокументСсылка = МоментВремениБыл.Ссылка;
			НоваяЗапись.Записать(Истина);
		КонецЕсли;
	КонецЦикла;
	
	// убираем циклические ссылки
	ДокументСсылка = Неопределено;
	
	Возврат Истина;
КонецФункции

// вызывается при непосредственном удалении проведенного документа
// проверяет есть ли граница с таким документом, если есть, то очищает ссылку
Процедура УбратьСсылку(Ссылка) Экспорт
	Запрос=Новый Запрос("
	|ВЫБРАТЬ
	|	Автомобиль КАК Автомобиль,
	|	МоментВремени КАК МоментВремени 
	|ИЗ
	|	РегистрСведений.ГраницыЗаказыНаАвтомобили 
	|ГДЕ
	|	ДокументСсылка=&Ссылка
	|");
	Запрос.УстановитьПараметр("Ссылка",Ссылка);
	Результат = Запрос.Выполнить();
	Если НЕ Результат.Пустой() Тогда
		Выборка = Результат.Выбрать();
		Пока Выборка.Следующий() Цикл
			НоваяЗапись = РегистрыСведений.ГраницыЗаказыНаАвтомобили.СоздатьМенеджерЗаписи();
			НоваяЗапись.Автомобиль = Выборка.Автомобиль;
			НоваяЗапись.МоментВремени = Выборка.МоментВремени;
			НоваяЗапись.ДокументСсылка = Неопределено;
			НоваяЗапись.Записать(Истина);
		КонецЦикла;
	КонецЕсли;
КонецПроцедуры
